Revit 2027 API
FilteredElementIterator.Reset Method
 Resets the iterator to the beginning.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Reset()
Public Overridable Sub Reset
public:
virtual void Reset()
abstract Reset : unit -> unit
override Reset : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The FilteredElementCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator.
See Also
Reference
FilteredElementIterator Class
Autodesk.Revit.DB Namespace